$(document).ready(function () {

    var obj = [{
            "title": "نص لوريم إيبسوم القياسي والمستخدم",
            "description": "وريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم إيبسوم ولايزال المعيار."
        },
        {
            "title": "نص لوريم إيبسوم القياسي والمستخدم",
            "description": "وريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم إيبسوم ولايزال المعيار."
        },
        {
            "title": "نص لوريم إيبسوم القياسي والمستخدم",
            "description": "وريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم إيبسوم ولايزال المعيار."
        },
        {
            "title": "نص لوريم إيبسوم القياسي والمستخدم",
            "description": "وريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم إيبسوم ولايزال المعيار."
        },
        {
            "title": "نص لوريم إيبسوم القياسي والمستخدم",
            "description": "وريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم إيبسوم ولايزال المعيار."
        },
        {
            "title": "نص لوريم إيبسوم القياسي والمستخدم",
            "description": "وريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم إيبسوم ولايزال المعيار."
        },
        {
            "title": "نص لوريم إيبسوم القياسي والمستخدم",
            "description": "وريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم إيبسوم ولايزال المعيار."
        },
        {
            "title": "نص لوريم إيبسوم القياسي والمستخدم",
            "description": "وريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم إيبسوم ولايزال المعيار."
        },
        {
            "title": "نص لوريم إيبسوم القياسي والمستخدم",
            "description": "وريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم إيبسوم ولايزال المعيار."
        },
        {
            "title": "نص لوريم إيبسوم القياسي والمستخدم",
            "description": "وريم إيبسوم هو ببساطة نص شكلي (بمعنى أن الغاية هي الشكل وليس المحتوى) ويُستخدم في صناعات المطابع ودور النشر. كان لوريم إيبسوم ولايزال المعيار."
        }
    ];

    $('#servicesByCarousel').empty();
    for (var i = 0; i < obj.length; i++) {
        $('#servicesByCarousel').append(`<div class="carousel-cell">
        <div class="block img-responsive">
          <h3 class="block-title">${obj[i].title}</h3>
          <p class="block-text">${obj[i].description}</p>
          <div class="block-footer">
            <p class="pull-left">
              <a href="#">إستفد من الخدمة</a>
            </p>
            <div class="icons pull-right">
              <img src="./img/Services-Manual-Icon.svg" alt="" title="" />
              <img src="./img/Services-Electronic-Icon.svg" alt="" title="" />
            </div>
          </div>
        </div>
      </div>`);
    }


    $('.main-carousel').flickity({
        pageDots: false,
        contain: true,
        initialIndex: 1,
        rightToLeft: true,
        cellAlign: 'left'
    });

});